[
  {
    "position": 1,
    "category": "arm",
    "data": [
      {
        "title": "Arm Muscle Pain",
        "src": "https://github.com/user-attachments/assets/1e06039c-ac07-41f8-b52b-4a99badfecb0",
        "preview": "https://github.com/user-attachments/assets/12c48c84-bc20-4ad4-bb74-3d0c7f2ab84f",
        "time": "00:25",
        "instructions": [
          "Warm-Up: Start with light cardio (e.g., arm swings, jumping jacks) to increase blood flow ,do dynamic stretches for the arms, such as arm circles or shoulder rolls.",
          "Targeted Exercises: Extend your arm straight, palm facing out. Gently pull your fingers back with the other hand. Hold for 20-30 seconds. Raise one arm overhead, bend the elbow, and touch your upper back. Use the other hand to push the elbow gently. Straighten your arm with the palm facing forward and fingers pointing down. Use the other hand to pull the fingers back gently.",
          "Cooldown: Finish with static stretches and deep breathing to relax the muscles."
        ],
        "focus_area": "Biceps, Triceps, Forearms",
        "common_mistakes": [
          "Skipping Warm-Up or Cooldown: Leads to tight muscles and increases the risk of injury.",
          "Overstretching: Can cause more harm to already strained muscles; only stretch to a comfortable point.",
          "Rushing Exercises: Perform movements slowly to maintain control and proper technique."
        ],
        "breathing_tips": "Match breathing with movement, Avoid holding your breath, Practice rhythmic breathing "
      },
      {
        "title": "Elbow Pain",
        "src": "https://github.com/user-attachments/assets/9b54f2db-eec3-4f7f-b129-702f9978544e",
        "preview": "https://github.com/user-attachments/assets/3eda9f05-9633-4726-8e41-427b34a492ee",
        "time": "00:32",
        "instructions": [
          "Warm-Up: Perform gentle elbow rotations and arm swings to increase mobility.",
          "Targeted Exercises: Straighten your arm and gently press down on your fingers with the other hand to stretch. Bend and extend your elbow slowly, holding a light object like a water bottle. Do wrist flexion and extension exercises to support elbow muscles.",
          "Cooldown: Stretch your arm muscles with static stretches and use a cold compress if necessary."
        ],
        "focus_area": "Elbow Joint, Forearms",
        "common_mistakes": [
          "Skipping Warm-Up: Can lead to stiff joints and reduced range of motion.",
          "Using Too Much Weight: May strain the elbow further; use light resistance.",
          "Fast Movements: Perform exercises slowly to maintain control and avoid pain."
        ],
        "breathing_tips": "Breathe deeply and exhale during stretching or exertion to relax the muscles."
      }
    ]
  },
  {
    "position": 2,
    "category": "back1",
    "data": [
      {
        "title": "Back Mistake Causes Acute Back Pain",
        "src": "https://github.com/user-attachments/assets/9b84226f-77f3-46fe-b711-00507da6f4e1",
        "preview": "https://github.com/user-attachments/assets/5d9c099d-f5f0-43b7-9129-5e39858396e1",
        "time": "00:31",
        "instructions": [
          "Warm-Up: Perform gentle pelvic tilts and back stretches to prepare your lower back muscles.",
          "Targeted Exercises: Engage in cat-cow stretches, standing back extensions, and child’s pose stretches to alleviate pain and improve flexibility.",
          "Cooldown: End with deep breathing and static stretching of the hamstrings and lower back."
        ],
        "focus_area": "Lower Back, Lumbar Spine, Core Muscles",
        "common_mistakes": [
          "Skipping warm-up, which increases the risk of strain.",
          "Overextending the back during exercises, causing more pain.",
          "Using incorrect posture while performing stretches."
        ],
        "breathing_tips": "Exhale during stretches, inhale during relaxation phases, and maintain a steady rhythm."
      },
      {
        "title": "Back Pain",
        "src": "https://github.com/user-attachments/assets/1a8ae0b5-55ab-49a7-be03-11de54a8a947",
        "preview": "https://github.com/user-attachments/assets/a7eb4be6-86fe-48f9-972a-07a36e745fcc",
        "time": "00:10",
        "instructions": [
          "Warm-Up: Do gentle seated back twists to loosen up your spine.",
          "Targeted Exercises: Perform knee-to-chest stretches and bridge poses to relieve tension.",
          "Cooldown: Conclude with light spinal rotations and controlled breathing."
        ],
        "focus_area": "Lower Back, Sacrum, Hip Flexors",
        "common_mistakes": [
          "Rushing through exercises without proper form.",
          "Holding your breath during movements.",
          "Skipping cooldown stretches."
        ],
        "breathing_tips": "Synchronize your breathing with movements; exhale as you stretch."
      }
    ]
  },
  {
    "position": 3,
    "category": "back2",
    "data": [
      {
        "title": "Kyphosis",
        "src": "https://github.com/user-attachments/assets/d75e3e75-e1c9-417a-95eb-08cdb8b8dfe2",
        "preview": "https://github.com/user-attachments/assets/2e1b6056-7107-4f8e-9c78-216ded31cf6f",
        "time": "00:13",
        "instructions": [
          "Warm-Up: Start with gentle spinal movements, such as cat-cow stretches, to mobilize the spine and increase flexibility.",
          "Targeted Exercises: Perform wall angels by standing with your back against a wall, raising your arms slowly to form a 'Y' shape, and then returning to the starting position. Practice seated thoracic extensions by placing your hands behind your head and gently arching your upper back over a chair.",
          "Cooldown: Finish with deep breathing and child’s pose to relax the spine and surrounding muscles."
        ],
        "focus_area": "Thoracic Spine, Upper Back, Postural Muscles",
        "common_mistakes": [
          "Using momentum instead of controlled movements: This reduces the effectiveness of the exercise.",
          "Skipping Warm-Up or Cooldown: Can lead to stiffness and limited mobility.",
          "Incorrect Posture: Ensure your back is aligned and core engaged during exercises."
        ],
        "breathing_tips": "Breathe deeply and rhythmically; inhale during the preparation phase and exhale during the movement phase."
      },
      {
        "title": "Improve Posture",
        "src": "https://github.com/user-attachments/assets/c407391a-dcfb-41dc-a019-43de1d53932c",
        "preview": "https://github.com/user-attachments/assets/2fe188dd-4c15-4463-97c1-61d58e83e271",
        "time": "00:14",
        "instructions": [
          "Warm-Up: Start with gentle neck rolls and shoulder shrugs to prepare the body.",
          "Targeted Exercises: Sit or stand straight and engage in a chin tuck exercise by gently pulling your chin back, aligning your ears with your shoulders. Perform wall angels by standing against a wall and sliding your arms up and down while keeping your back flat. Stretch your upper back by clasping your hands in front of you and rounding your shoulders.",
          "Cooldown: Finish with seated forward bends and deep breathing to release tension."
        ],
        "focus_area": "Upper Back, Shoulders, Neck",
        "common_mistakes": [
          "Slouching: Maintain a neutral spine during all exercises.",
          "Overarching the Back: Avoid overcompensating by arching excessively.",
          "Neglecting Breathing: Ensure consistent breathing throughout movements."
        ],
        "breathing_tips": "Exhale during stretches and inhale when returning to the starting position. Maintain steady, deep breaths throughout."
      }
    ]
  },
  {
    "position": 4,
    "category": "head",
    "data": [
      {
        "title": "Chin",
        "src": "https://github.com/user-attachments/assets/f27fb813-19d9-47d6-8441-6c81ecc7a296",
        "preview": "https://github.com/user-attachments/assets/16d9c9b2-d42d-436e-970b-1c46f560ecd6",
        "time": "00:29",
        "instructions": [
          "Warm-Up: Begin with gentle neck stretches and rotations.",
          "Targeted Exercises: Focus on chin tucks and gentle neck exercises to improve posture.",
          "Cooldown: End with slow head tilts and deep breathing to relax the neck."
        ],
        "focus_area": "Neck, Posture, Flexibility",
        "common_mistakes": [
          "Overextending the neck: Move within a comfortable range to avoid strain.",
          "Not engaging the core: Keep the core engaged to support the neck during exercises.",
          "Rushing the movements: Perform each movement slowly and deliberately."
        ],
        "breathing_tips": "Inhale as you prepare, exhale as you perform each movement."
      },
      {
        "title": "Eye Muscle",
        "src": "https://github.com/user-attachments/assets/998fa9ae-c6ef-40ce-870f-b7d0da1887da",
        "preview": "https://github.com/user-attachments/assets/1efb99ff-8cb8-423c-b0ca-5f4b63977a37",
        "time": "00:12",
        "instructions": [
          "Warm-Up: Relax the face and gently massage around the eyes.",
          "Targeted Exercises: Focus on strengthening eye muscles with focused gazing and eye movements.",
          "Cooldown: Close the eyes and relax with deep breathing."
        ],
        "focus_area": "Eyes, Eye Muscles, Strength",
        "common_mistakes": [
          "Straining the eyes: Perform movements gently to avoid eye strain.",
          "Forgetting to blink: Blink frequently to prevent dryness.",
          "Holding the gaze too long: Change focus to avoid tiring the eyes."
        ],
        "breathing_tips": "Inhale deeply before each movement, exhale as you perform the exercise."
      }
    ]
  },
  {
    "position": 5,
    "category": "leg",
    "data": [
      {
        "title": "Ankle Pain",
        "src": "https://github.com/user-attachments/assets/698acc1d-654d-4a90-bc96-b3333e006ad5",
        "preview": "https://github.com/user-attachments/assets/d5ba60b4-0f6c-4de4-8b76-a6372a1e4774",
        "time": "00:18",
        "instructions": [
          "Warm-Up: Perform gentle ankle rotations to loosen up the joint.",
          "Targeted Exercises: Focus on ankle stretches and strengthening exercises to reduce pain.",
          "Cooldown: End with a gentle massage of the ankle area to relieve tension."
        ],
        "focus_area": "Ankle Pain, Joint Flexibility",
        "common_mistakes": [
          "Overextending the ankle: Perform stretches gently to avoid injury.",
          "Not warming up: Always warm up your joints before performing exercises.",
          "Ignoring discomfort: If the pain worsens, stop immediately and consult a professional."
        ],
        "breathing_tips": "Breathe deeply and slowly while performing exercises to relax the muscles."
      },
      {
        "title": "Anti Flip",
        "src": "https://github.com/user-attachments/assets/ae1f2a9e-c341-4fbb-bc0e-74e953976561",
        "preview": "https://github.com/user-attachments/assets/d9ee031a-04f6-47e4-9ea2-aa4648a2b313",
        "time": "00:21",
        "instructions": [
          "Warm-Up: Start with ankle mobility exercises.",
          "Targeted Exercises: Focus on strengthening and stabilizing the ankle joint to prevent flipping.",
          "Cooldown: Perform light stretches and relaxation for the ankle muscles."
        ],
        "focus_area": "Ankle Strength, Injury Prevention",
        "common_mistakes": [
          "Forcing movements: Perform the exercises at a comfortable pace.",
          "Not engaging the muscles: Ensure the muscles around the ankle are actively engaged.",
          "Skipping cooldown: Finish with stretches to prevent stiffness."
        ],
        "breathing_tips": "Maintain steady, deep breaths to enhance the stability exercises."
      }
    ]
  },
  {
    "position": 6,
    "category": "neck",
    "data": [
      {
        "title": "Neck Exercise",
        "src": "https://github.com/user-attachments/assets/bfca53a8-3c00-4c35-9c67-d6c948a20188",
        "preview": "https://github.com/user-attachments/assets/047e2eb2-6b4d-4959-b851-7cc3130f2add",
        "time": "00:29",
        "instructions": [
          "Warm-Up: Perform neck rotations to activate the muscles.",
          "Targeted Exercises: Engage in strengthening and stretching movements for the neck and shoulders.",
          "Cooldown: Stretch gently to enhance flexibility and reduce tension."
        ],
        "focus_area": "Neck Strengthening, Pain Relief",
        "common_mistakes": [
          "Overdoing it: Avoid excessive pressure on the neck during exercises.",
          "Ignoring posture: Maintain proper alignment to prevent strain.",
          "Skipping cooldown: End with stretches to ensure muscle relaxation."
        ],
        "breathing_tips": "Breathe evenly to stay relaxed and focused during exercises."
      },
      {
        "title": "Neck Pain",
        "src": "https://github.com/user-attachments/assets/97e1b6f2-8e55-42f9-9ddf-0cb6752cfdb4",
        "preview": "https://github.com/user-attachments/assets/511258ea-2072-406a-b592-880f59313a8e",
        "time": "00:17",
        "instructions": [
          "Warm-Up: Begin with light shoulder shrugs to loosen the neck area.",
          "Targeted Exercises: Focus on relieving neck pain through controlled movements.",
          "Cooldown: Stretch gently to relax the neck muscles."
        ],
        "focus_area": "Neck Pain Relief, Muscle Relaxation",
        "common_mistakes": [
          "Forcing movements: Keep exercises within your comfort zone.",
          "Skipping warm-up: Always start with a warm-up to prepare the muscles.",
          "Not listening to your body: Stop if discomfort increases."
        ],
        "breathing_tips": "Breathe deeply to enhance the effectiveness of the stretches."
      }
    ]
  },
  {
    "position": 7,
    "category": "shoulder",
    "data": [
      {
        "title": "Rotator Cuff",
        "src": "https://github.com/user-attachments/assets/793a1411-110a-4e65-aa56-cb9fd11e4e71",
        "preview": "https://github.com/user-attachments/assets/abce57c9-c8ab-4433-be4f-0a72ae6bf827",
        "time": "00:19",
        "instructions": [
          "Warm-Up: Start with gentle arm and shoulder rotations to loosen up the muscles.",
          "Targeted Exercises: Perform exercises focused on strengthening the rotator cuff muscles.",
          "Cooldown: Stretch gently to prevent stiffness and improve flexibility."
        ],
        "focus_area": "Rotator Cuff Strengthening, Shoulder Health",
        "common_mistakes": [
          "Using improper form: Ensure proper technique to avoid straining the rotator cuff.",
          "Exercising too quickly: Start slow and gradually increase intensity.",
          "Skipping cooldown: Always stretch after exercises to maintain flexibility."
        ],
        "breathing_tips": "Breathe deeply as you perform the exercises, inhaling during the relaxation phase and exhaling during exertion."
      },
      {
        "title": "Shoulder Pain",
        "src": "https://github.com/user-attachments/assets/1d385ba7-aa97-4996-bc51-e78a8c0aa5f9",
        "preview": "https://github.com/user-attachments/assets/b5a11bdd-fd0b-4387-9604-2cc032dc996f",
        "time": "00:17",
        "instructions": [
          "Warm-Up: Stretch the shoulder area to increase circulation and reduce stiffness.",
          "Targeted Exercises: Perform gentle strengthening exercises for the shoulder muscles.",
          "Cooldown: Stretch to help relax the muscles and reduce pain."
        ],
        "focus_area": "Shoulder Pain Relief, Flexibility",
        "common_mistakes": [
          "Overexertion: Perform exercises at a low intensity to avoid further injury.",
          "Skipping warm-up: Always warm-up the muscles before starting exercises.",
          "Ignoring pain signals: Stop exercises if pain intensifies."
        ],
        "breathing_tips": "Breathe deeply and exhale as you release the stretch to promote relaxation."
      }
    ]
  }
]
  
  
  
  
